app/Models/Agenda/CumpleanerosModel.php

SELECT `a`.`nombres`, `a`.`primerApellido`, `a`.`fechaNacimiento`, `b`.`personaId`, `c`.`sucursalId`
FROM `pe_personas` `a`
JOIN `pe_empleados` `b` ON `a`.`personaId` = `b`.`personaId`
JOIN `co_empleado_sucursal` `c` ON `b`.`empleadoId`=`c`.`empleadoId`
JOIN `co_sucursales` `d` ON `d`.`sucursalId` = `c`.`sucursalId`
WHERE MONTH(a.fechaNacimiento) = '7'
AND `c`.`sucursalId` = '1'
---
    public function cumplesXSucursal($sucursalId, $mes)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('pe_personas a');
        $builder->select('
        a.nombres, a.primerApellido, a.fechaNacimiento, b.personaId, c.sucursalId
        ');
        $builder->join('pe_empleados b','a.personaId = b.personaId');
        $builder->join('co_empleado_sucursal c','b.empleadoId=c.empleadoId');
        $builder->join('co_sucursales d','d.sucursalId = c.sucursalId');
        $builder->where('MONTH(a.fechaNacimiento)', $mes);
        $builder->where('c.sucursalId', $sucursalId);
        $datos = $builder->get()->getResultArray();