app/Controllers/Expediente/PacientesMediosController.php

SELECT *
FROM `co_paciente_medio`
WHERE `co_paciente_medio`.`pacMedId` = '21'
---
    public function obtenerId()
    {
        $pacMedios = new PacienteMedioModel();
        $id = $this->request->getPost('id');
        $data['pacMedId'] = $pacMedios->find($id);