app/Models/InsumoModel.php

SELECT `a`.`fechaCaducidad`, `c`.`insumo`, `a`.`notifAlertas`
FROM `in_compra_detalle` `a`
JOIN `in_unidad_detalle` `b` ON `a`.`uniDetId` = `b`.`uniDetId`
JOIN `in_insumos` `c` ON `c`.`insumoId` = `b`.`insumoId`
WHERE `a`.`fechaCaducidad` < CURDATE()
AND `a`.`notifAlertas` = 0
---
    public function obtenerElemento(){
        $db = \Config\Database::connect();
        $builder = $db->table('in_compra_detalle a');
        $builder->select('
        a.fechaCaducidad, c.insumo, a.notifAlertas
        ');
        $builder->join('in_unidad_detalle b', 'a.uniDetId = b.uniDetId');
        $builder->join('in_insumos c','c.insumoId = b.insumoId');
        $builder->where('a.fechaCaducidad < CURDATE()');
        $builder->where('a.notifAlertas', 0);
        $datos = $builder->get()->getResultArray();