app/Models/NotificacionModel.php

SELECT *
FROM `in_insumos`
WHERE `cantidadAct` <= 10
---
    public function obtenerNotificaciones()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('in_insumos');
        $cantidadMin = 10; // Cantidad mínima para generar la notificación

        // Consultar los insumos que tienen cantidad actual menor o igual a la cantidad mínima
        $builder->select('*');
        $builder->where('cantidadAct <=', $cantidadMin);
        $datos = $builder->get()->getResultArray();