app/Models/Expediente/PacienteModel.php

SELECT *
FROM `pe_personas` `a`
---
    public function nombrePaciente()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('pe_personas a');
        $builder->select(' * ');
        $datos = $builder->get()->getResultArray();

SELECT *
FROM `co_medios_conocer` `b`
---
    public function nombreMedio()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('co_medios_conocer b');
        $builder->select(' * ');
        $datos = $builder->get()->getResultArray();

SELECT *
FROM `ex_intereses` `c`
---
    public function nombreInteres()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('ex_intereses c');
        $builder->select(' * ');
        $datos = $builder->get()->getResultArray();