app/Models/Configuracion/DocumentosModel.php

SELECT *
FROM `co_tipo_documento`
---
    public function mostrarTipoDocumento()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('co_tipo_documento');
        $builder->select('*');
        $query = $builder->get()->getResultArray();